// Реализовать простой калькулятор (+ - / *)
// Ввод числа ->
// Ввод знака ->
// Ввод числа ->

package HW.hw_1;

import java.util.Scanner;

public class ex_3 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите число: ");
        int num = sc.nextInt();
        System.out.println("Введите число: ");
        int num = sc.nextInt();
        System.out.println("Введите число: ");
        int num = sc.nextInt();


    }
}
